/*
 * See ../README.md
 */

/*
 * Run as: rexx ch-1.rexx
 */

say "    ^^^^^"
say "   ^     ^"
say "  ^       ^"
say " ^         ^"
say " ^         ^"
say " ^         ^"
say " ^         ^"
say " ^         ^"
say "  ^       ^"
say "   ^     ^"
say "    ^^^^^"
say "      ^"
say "      ^"
say "      ^"
say "    ^^^^^"
say "      ^"
say "      ^"