/*
 * See https://theweeklychallenge.org/blog/perl-weekly-challenge-148
 */

/*
 * Run as: rexx ch-2.rexx
 */

say "2 1 5"
say "5 2 13"
say "8 3 21"
say "17 18 5"
say "11 4 29"
