/*
 * See https://theweeklychallenge.org/blog/perl-weekly-challenge-154
 */

/*
 * Run as: rexx ch-2.rexx
 */

say "2, 3, 5, 7, 37, 151, 3329, 23833, 13091204281, 3093215881333057"
