/*
 * See https://theweeklychallenge.org/blog/perl-weekly-challenge-147
 */

/*
 * Run as: rexx ch-1.rexx
 */

say "2 3 5 7 13 17 23 37 43 47 53 67 73 83 97 113 137 167 173 197"