(ql:quickload "fiveam")
(use-package :fiveam)


(defun echo_chamber (xx)
    (format nil "~{~A~}"
    (loop for x from 0 to (- (length xx) 1)
      collect (make-string (+ 1 x) :initial-element (char xx x))
          ) )
    )

(test 362_test 
    (is (string= "abbcccaaaa" (echo_chamber "abca")))
    (is (string= "xyyzzz" (echo_chamber "xyz")))
    (is (string= "coodddeeee" (echo_chamber "code")))
    (is (string= "heelllllllooooo" (echo_chamber "hello")))
    (is (string= "a" (echo_chamber "a")))
    )

(run! '362_test)


